BAS BMEKZU Project/src/InformationRegisters/скEDI_СодержимоеЭлектронныхДокументов/скEDI_СодержимоеЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_СодержимоеЭлектронныхДокументов</name>
  <resources>
    <name>ТелоДокумента</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоДокументаХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИзображениеДокумента</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИзображениеДокументаХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента1</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента1ХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаВложениеДокумента1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента2</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента2ХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаВложениеДокумента2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента3</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВложениеДокумента3ХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаВложениеДокумента3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DocHref</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DocVer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументДФС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученоОтКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолученоОтКонтрагентаСПомощью</name>
    <type>
      <types>EnumRef.скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту</types>
    </type>
  </resources>
  <resources>
    <name>ДокументДляДФС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВнешнееХранилище</name>
    <type>
      <types>CatalogRef.скEDI_ВнешниеХранилищаСодержимогоЭлектронныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПоВнешнемуХранилищу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.скEDI_ЭлектронныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС/скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС</name>
  <resources>
    <name>ТелоДокумента</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоДокументаХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИзображениеДокумента</name>
    <comment>Base64-строка</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИзображениеДокументаХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВнешнееХранилище</name>
    <type>
      <types>CatalogRef.скEDI_ВнешниеХранилищаСодержимогоЭлектронныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПоВнешнемуХранилищу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.скEDI_ЗапросНаПолучениеРеквизитовЭлектронногоСчета</types>
      <types>DocumentRef.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН</types>
      <types>DocumentRef.скEDI_ЗапросНаПолучениеВедомостейЕРНН</types>
      <types>DocumentRef.скEDI_ЗапросНаПолучениеВедомостейЕРАН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСодержимого</name>
    <type>
      <types>EnumRef.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов/скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов</name>
  <enumValues>
    <name>MSSQLServer</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/CommonModules/скEDI_ВнешниеХранилища/Module.bsl
Процедура СохранитьСодержимоеЭлектронногоДокумента(
	ЭлектронныйДокумент,
	НомерВерсии,
	ТелоДокумента,
	ИзображениеДокумента,
	ВложениеДокумента1,
	ИмяФайлаВложениеДокумента1,
	ВложениеДокумента2,
	ИмяФайлаВложениеДокумента2,
	ВложениеДокумента3,
	ИмяФайлаВложениеДокумента3,
	МассивВложенийДокумента4,
	Дата,
	ИмяФайла,
	ВерсияДокументаВПлатформеПТАХ,
	СсылкаНаДокумент,
	ДокументДФС,
	ПолученоОтКонтрагента,
	ПолученоОтКонтрагентаСПомощью,
	ДокументДляДФС
	) Экспорт
	
	
	СохранитьСодержимоеЭлектронногоДокумента_ВыполнитьЗапись(
		ЭлектронныйДокумент,
		НомерВерсии,
		0,
		ТелоДокумента,
		ИзображениеДокумента,
		ВложениеДокумента1,
		ИмяФайлаВложениеДокумента1,
		ВложениеДокумента2,
		ИмяФайлаВложениеДокумента2,
		ВложениеДокумента3,
		ИмяФайлаВложениеДокумента3,
		Дата,
		ИмяФайла,
		ВерсияДокументаВПлатформеПТАХ,
		СсылкаНаДокумент,
		ДокументДФС,
		ПолученоОтКонтрагента,
		ПолученоОтКонтрагентаСПомощью,
		ДокументДляДФС
		);
	
	
	Если ТипЗнч(МассивВложенийДокумента4) = Тип("Массив") или ТипЗнч(МассивВложенийДокумента4) = Тип("ФиксированныйМассив") Тогда
		НомерДополнения = 1;
		ТекНомерЭлемента = 0;
		Пока Истина Цикл
			дВложениеДокумента1 = "";
			дИмяФайлаВложениеДокумента1 = "";
			дВложениеДокумента2 = "";
			дИмяФайлаВложениеДокумента2 = "";
			дВложениеДокумента3 = "";
			дИмяФайлаВложениеДокумента3 = "";
			Сохранять = Ложь;
			
			Если ТекНомерЭлемента < МассивВложенийДокумента4.Количество() Тогда
				ЭлементМассиваВложенийДокумента4 = МассивВложенийДокумента4[ТекНомерЭлемента];
				дВложениеДокумента1 = ЭлементМассиваВложенийДокумента4.ВложениеДокумента;
				дИмяФайлаВложениеДокумента1 = ЭлементМассиваВложенийДокумента4.ИмяФайлаВложениеДокумента;
				ТекНомерЭлемента = ТекНомерЭлемента + 1;
				Сохранять = Истина;
			КонецЕсли;
			
			Если ТекНомерЭлемента < МассивВложенийДокумента4.Количество() Тогда
				ЭлементМассиваВложенийДокумента4 = МассивВложенийДокумента4[ТекНомерЭлемента];
				дВложениеДокумента2 = ЭлементМассиваВложенийДокумента4.ВложениеДокумента;
				дИмяФайлаВложениеДокумента2 = ЭлементМассиваВложенийДокумента4.ИмяФайлаВложениеДокумента;
				ТекНомерЭлемента = ТекНомерЭлемента + 1;
				Сохранять = Истина;
			КонецЕсли;
			
			Если ТекНомерЭлемента < МассивВложенийДокумента4.Количество() Тогда
				ЭлементМассиваВложенийДокумента4 = МассивВложенийДокумента4[ТекНомерЭлемента];
				дВложениеДокумента3 = ЭлементМассиваВложенийДокумента4.ВложениеДокумента;
				дИмяФайлаВложениеДокумента3 = ЭлементМассиваВложенийДокумента4.ИмяФайлаВложениеДокумента;
				ТекНомерЭлемента = ТекНомерЭлемента + 1;
				Сохранять = Истина;
			КонецЕсли;
			
			Если Сохранять Тогда
				СохранитьСодержимоеЭлектронногоДокумента_ВыполнитьЗапись(
					ЭлектронныйДокумент,
					НомерВерсии,
					НомерДополнения,
					"",
					"",
					дВложениеДокумента1,
					дИмяФайлаВложениеДокумента1,
					дВложениеДокумента2,
					дИмяФайлаВложениеДокумента2,
					дВложениеДокумента3,
					дИмяФайлаВложениеДокумента3,
					Дата,
					ИмяФайла,
					ВерсияДокументаВПлатформеПТАХ,
					СсылкаНаДокумент,
					ДокументДФС,
					ПолученоОтКонтрагента,
					ПолученоОтКонтрагентаСПомощью,
					ДокументДляДФС
					);
				
				НомерДополнения = НомерДополнения + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СохранитьСодержимоеЭлектронногоДокумента_ВыполнитьЗапись(
	ЭлектронныйДокумент,
	НомерВерсии,
	НомерДополнения,
	ТелоДокумента,
	ИзображениеДокумента,
	ВложениеДокумента1,
	ИмяФайлаВложениеДокумента1,
	ВложениеДокумента2,
	ИмяФайлаВложениеДокумента2,
	ВложениеДокумента3,
	ИмяФайлаВложениеДокумента3,
	Дата,
	ИмяФайла,
	ВерсияДокументаВПлатформеПТАХ,
	СсылкаНаДокумент,
	ДокументДФС,
	ПолученоОтКонтрагента,
	ПолученоОтКонтрагентаСПомощью,
	ДокументДляДФС
	)
	
	ТекВнешнееХранилище = Константы.скEDI_ТекущееВнешнееХранилищеСодержимогоЭлектронныхДокументов.Получить();
	ТекТипХранилища = Неопределено;
	Если ЗначениеЗаполнено(ТекВнешнееХранилище) Тогда
		Если ТекВнешнееХранилище.Настроено Тогда
			ТекТипХранилища = ТекВнешнееХранилище.ТипХранилища;
		Иначе
			ТекВнешнееХранилище = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекТипХранилища = ПредопределенноеЗначение("Перечисление.скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов.MSSQLServer") Тогда
		ИдентификаторПоВнешнемуХранилищу = "";
		Если скEDI_ВнешниеХранилищаMSSQLServer.СохранитьСодержимоеЭлектронногоДокумента(ТекВнешнееХранилище, ИдентификаторПоВнешнемуХранилищу, ЭлектронныйДокумент, НомерВерсии,
			ТелоДокумента, ИзображениеДокумента, ВложениеДокумента1, ВложениеДокумента2, ВложениеДокумента3
			) Тогда
			
			СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеЭлектронныхДокументов.СоздатьМенеджерЗаписи();
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерВерсии = НомерВерсии;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерДополнения = НомерДополнения;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = ИзображениеДокумента;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1 = ВложениеДокумента1;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента1 = ИмяФайлаВложениеДокумента1;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента2 = ВложениеДокумента2;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента2 = ИмяФайлаВложениеДокумента2;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента3 = ВложениеДокумента3;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента3 = ИмяФайлаВложениеДокумента3;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагента = ПолученоОтКонтрагента;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагентаСПомощью = ПолученоОтКонтрагентаСПомощью;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументДФС = ДокументДФС;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументдляДФС = ДокументдляДФС;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайла = ИмяФайла;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocVer = ВерсияДокументаВПлатформеПТАХ;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocHref = СсылкаНаДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
		Иначе
			СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеЭлектронныхДокументов.СоздатьМенеджерЗаписи();
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерВерсии = НомерВерсии;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерДополнения = НомерДополнения;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
			Если ЗначениеЗаполнено(ТелоДокумента) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ТелоДокумента);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = ИзображениеДокумента;
			Если ЗначениеЗаполнено(ИзображениеДокумента) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ИзображениеДокумента);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1 = ВложениеДокумента1;
			Если ЗначениеЗаполнено(ВложениеДокумента1) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента1);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента1 = ИмяФайлаВложениеДокумента1;
			
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента2 = ВложениеДокумента2;
			Если ЗначениеЗаполнено(ВложениеДокумента2) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента2);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента2ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента2 = ИмяФайлаВложениеДокумента2;
			
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента3 = ВложениеДокумента3;
			Если ЗначениеЗаполнено(ВложениеДокумента3) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента3);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента3ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента3 = ИмяФайлаВложениеДокумента3;
			
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагента = ПолученоОтКонтрагента;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагентаСПомощью = ПолученоОтКонтрагентаСПомощью;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументДФС = ДокументДФС;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументдляДФС = ДокументдляДФС;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайла = ИмяФайла;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocVer = ВерсияДокументаВПлатформеПТАХ;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocHref = СсылкаНаДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	Иначе
		СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеЭлектронныхДокументов.СоздатьМенеджерЗаписи();
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерВерсии = НомерВерсии;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.НомерДополнения = НомерДополнения;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
		Если ЗначениеЗаполнено(ТелоДокумента) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ТелоДокумента);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = ИзображениеДокумента;
		Если ЗначениеЗаполнено(ИзображениеДокумента) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ИзображениеДокумента);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1 = ВложениеДокумента1;
		Если ЗначениеЗаполнено(ВложениеДокумента1) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента1);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента1 = ИмяФайлаВложениеДокумента1;
		
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента2 = ВложениеДокумента2;
		Если ЗначениеЗаполнено(ВложениеДокумента2) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента2);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента2ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента2 = ИмяФайлаВложениеДокумента2;
		
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента3 = ВложениеДокумента3;
		Если ЗначениеЗаполнено(ВложениеДокумента3) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ВложениеДокумента3);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента3ХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайлаВложениеДокумента3 = ИмяФайлаВложениеДокумента3;
		
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагента = ПолученоОтКонтрагента;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ПолученоОтКонтрагентаСПомощью = ПолученоОтКонтрагентаСПомощью;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументДФС = ДокументДФС;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ДокументдляДФС = ДокументдляДФС;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИмяФайла = ИмяФайла;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocVer = ВерсияДокументаВПлатформеПТАХ;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.DocHref = СсылкаНаДокумент;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

Процедура СохранитьСодержимоеДополнительногоЭлектронногоДокументаДФС(
	ЭлектронныйДокумент,
	ТипСодержимого,
	ТелоДокумента,
	ИзображениеДокумента,
	Дата
	) Экспорт
	
	ТекВнешнееХранилище = Константы.скEDI_ТекущееВнешнееХранилищеСодержимогоЭлектронныхДокументов.Получить();
	ТекТипХранилища = Неопределено;
	Если ЗначениеЗаполнено(ТекВнешнееХранилище) Тогда
		Если ТекВнешнееХранилище.Настроено Тогда
			ТекТипХранилища = ТекВнешнееХранилище.ТипХранилища;
		Иначе
			ТекВнешнееХранилище = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекТипХранилища = ПредопределенноеЗначение("Перечисление.скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов.MSSQLServer") Тогда
		ИдентификаторПоВнешнемуХранилищу = "";
		Если скEDI_ВнешниеХранилищаMSSQLServer.СохранитьСодержимоеДополнительногоЭлектронногоДокументаДФС(ТекВнешнееХранилище, ИдентификаторПоВнешнемуХранилищу, ЭлектронныйДокумент, ТипСодержимого, ТелоДокумента, ИзображениеДокумента) Тогда
			
			СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.СоздатьМенеджерЗаписи();
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТипСодержимого = ТипСодержимого;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = ИзображениеДокумента;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВложениеДокумента1 = ВложениеДокумента1;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
		Иначе
			СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.СоздатьМенеджерЗаписи();
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТипСодержимого = ТипСодержимого;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
			Если ЗначениеЗаполнено(ТелоДокумента) Тогда
				ДвоичныеДанныеПоBase64 =  Base64Значение(ТелоДокумента);
				СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
			КонецЕсли;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
			//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	Иначе
		СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.СоздатьМенеджерЗаписи();
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТипСодержимого = ТипСодержимого;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ТелоДокумента;
		Если ЗначениеЗаполнено(ТелоДокумента) Тогда
			ДвоичныеДанныеПоBase64 =  Base64Значение(ТелоДокумента);
			СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокументаХЗ = Новый ХранилищеЗначения(ДвоичныеДанныеПоBase64, Новый СжатиеДанных(9));
		КонецЕсли;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = ИзображениеДокумента;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = Дата;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ВнешнееХранилище = ТекВнешнееХранилище;
		//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИдентификаторПоВнешнемуХранилищу = ИдентификаторПоВнешнемуХранилищу;
		СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСодержимоеЭлектронногоДокумента(
	ВнешнееХранилище,
	ЭлектронныйДокумент,
	ИдентификаторПоВнешнемуХранилищу,
	НомерВерсии,
	ТелоДокумента,
	ИзображениеДокумента,
	ВложениеДокумента1,
	ВложениеДокумента2,
	ВложениеДокумента3,
	Ошибка
	) Экспорт
	
	ТекТипХранилища = Неопределено;
	Если ЗначениеЗаполнено(ВнешнееХранилище) Тогда
		Если ВнешнееХранилище.Настроено Тогда
			ТекТипХранилища = ВнешнееХранилище.ТипХранилища;
		Иначе
			Ошибка = НСтр("ru = 'Внешнее хранилище не настроено!'; uk = 'Зовнішнє сховище не налаштовано!'");
			Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Ошибка = НСтр("ru = 'Внешнее хранилища не определено!'; uk = 'Зовнішнє сховища не визначено!'");
		Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекТипХранилища = ПредопределенноеЗначение("Перечисление.скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов.MSSQLServer") Тогда
		Если скEDI_ВнешниеХранилищаMSSQLServer.ПолучитьСодержимоеЭлектронногоДокумента(ВнешнееХранилище, ЭлектронныйДокумент, ИдентификаторПоВнешнемуХранилищу, НомерВерсии,
			ТелоДокумента, ИзображениеДокумента, ВложениеДокумента1, ВложениеДокумента2, ВложениеДокумента3,
			Ошибка) Тогда
			//Ошибка = "";НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Ошибка = НСтр("ru = 'Тип внешнего хранилища не определен!'; uk = 'Тип зовнішнього сховища не визначено!'");
		Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьСодержимоеДополнительногоЭлектронногоДокументаДФС(
	ВнешнееХранилище,
	ЭлектронныйДокумент,
	ИдентификаторПоВнешнемуХранилищу,
	ТипСодержимого,
	ТелоДокумента,
	ИзображениеДокумента,
	Ошибка
	) Экспорт
	
	ТекТипХранилища = Неопределено;
	Если ЗначениеЗаполнено(ВнешнееХранилище) Тогда
		Если ВнешнееХранилище.Настроено Тогда
			ТекТипХранилища = ВнешнееХранилище.ТипХранилища;
		Иначе
			Ошибка = НСтр("ru = 'Внешнее хранилище не настроено!'; uk = 'Зовнішнє сховище не налаштовано!'");
			Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Ошибка = НСтр("ru = 'Внешнее хранилища не определено!'; uk = 'Зовнішнє сховища не визначено!'");
		Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекТипХранилища = ПредопределенноеЗначение("Перечисление.скEDI_ТипыВнешнихХранилищСодержимогоЭлектронныхДокументов.MSSQLServer") Тогда
		Если скEDI_ВнешниеХранилищаMSSQLServer.ПолучитьСодержимоеДополнительногоЭлектронногоДокументаДФС(ВнешнееХранилище, ЭлектронныйДокумент, ИдентификаторПоВнешнемуХранилищу, ТелоДокумента, ИзображениеДокумента, Ошибка) Тогда
			Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Ошибка = НСтр("ru = 'Тип внешнего хранилища не определен!'; uk = 'Тип зовнішнього сховища не визначено!'");
		Ошибка = НСтр("ru = 'Не удалось получить содержимое Электронного документа.'; uk = 'Не вдалось отримати вміст Електронного документу.'") + Символы.ПС + Ошибка;
		Возврат Ложь;
	КонецЕсли;
КонецФункции
